9/data/attachments/b8cbfd1424de6a49.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ab958f1b-5b02-4dd2-8fc6-421991f2fb8a</nif:username>
            <nif:friendToBeAdded>John_study_Friend_17075_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>